micropython/micropython/ports/mimxrt/machine_can.c
        mp_int_t irq_flags = 0;

        // Maybe not disable the interrupts.
        if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoOverflowFlag)) {
            FLEXCAN_DisableMbInterrupts(port->can_inst,
                kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
            irq_flags |= MP_CAN_IRQ_RX_OVERFLOW;
        }
        if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoWarningFlag)) {
            FLEXCAN_DisableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
            irq_flags |= MP_CAN_IRQ_RX_WARNING;
        }
        if (FLEXCAN_GetMbStatusFlags(port->can_inst, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)) {
            FLEXCAN_DisableMbInterrupts(port->can_inst, kFLEXCAN_RxFifoFrameAvlFlag);
            irq_flags |= MP_CAN_IRQ_RX;
        }
        port->mp_irq_flags = irq_flags;

        if (irq_flags & self->mp_irq_trigger) {
            mp_irq_handler(self->mp_irq_obj);
        }
    }
}

#if defined(CAN1)
void CAN1_IRQHandler(void) {
    machine_can_handler(CAN1);
}
#endif

#if defined(CAN2)
void CAN2_IRQHandler(void) {
    machine_can_handler(CAN2);
}
#endif

#if defined(CAN3)
void CAN3_IRQHandler(void) {
    machine_can_handler(CAN3);
}
#endif

static void machine_can_port_deinit(machine_can_obj_t *self) {
    if (MP_STATE_PORT(machine_can_objs[self->can_idx]) != NULL) {
        struct machine_can_port *port = self->port;
        mp_uint_t instance = FLEXCAN_GetInstance(port->can_inst);
        DisableIRQ(((IRQn_Type [])CAN_Rx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Tx_Warning_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Error_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_Bus_Off_IRQS)[instance]);
        DisableIRQ(((IRQn_Type [])CAN_ORed_Message_buffer_IRQS)[instance]);
        FLEXCAN_DisableInterrupts(port->can_inst,
            kFLEXCAN_BusOffInterruptEnable | kFLEXCAN_ErrorInterruptEnable |
            kFLEXCAN_RxWarningInterruptEnable | kFLEXCAN_TxWarningInterruptEnable);
        FLEXCAN_DisableMbInterrupts(port->can_inst,
            kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);
        MP_STATE_PORT(machine_can_objs[self->can_idx]) = NULL;
        port->is_enabled = false;
        FLEXCAN_Deinit(port->can_inst);
    }
}

// Deinit all can IRQ handlers.
void machine_can_irq_deinit(void) {
    for (int i = 0; i < MICROPY_HW_NUM_CAN_IRQS; ++i) {
        machine_can_obj_t *machine_can_obj = MP_STATE_PORT(machine_can_objs[i]);
        if (machine_can_obj != NULL) {
            machine_can_port_deinit(machine_can_obj);
        }
    }
}

#if CAN_PORT_PRINT_FUNCTION
static void machine_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    struct machine_can_port *port = self->port;

    if (!port->is_enabled) {
        mp_printf(print, "CAN(%u)", self->can_idx + 1);
    } else {
        qstr mode = MP_QSTR_MODE_NORMAL;
        if (port->flexcan_config->enableLoopBack) {
            if (port->flexcan_config->enableListenOnlyMode) {
                mode = MP_QSTR_MODE_SILENT_LOOPBACK;
            } else {
                mode = MP_QSTR_MODE_LOOPBACK;
            }
        } else if (port->flexcan_config->enableListenOnlyMode) {
            mode = MP_QSTR_MODE_SILENT;
        }
        mp_printf(print, "CAN(%u, bitrate=%u, mode=CAN.%q, auto_restart=%q)",
            self->can_idx + 1,
            port->flexcan_config->bitRate,
            mode,
            (port->can_inst->CTRL1 & CAN_CTRL1_BOFFREC_MASK) ? MP_QSTR_False : MP_QSTR_True);
    }
}
#endif

// Convert the port agnostic CAN mode to the ST mode
static uint32_t can_port_mode(machine_can_mode_t mode) {
    switch (mode) {
        case MP_CAN_MODE_NORMAL:
            return CAN_NORMAL_MODE;
        case MP_CAN_MODE_SLEEP:
            return CAN_SILENT_FLAG; // Sleep is not an operating mode for ST's peripheral
        case MP_CAN_MODE_LOOPBACK:
            return CAN_LOOPBACK_FLAG;
        case MP_CAN_MODE_SILENT:
            return CAN_SILENT_FLAG;
        case MP_CAN_MODE_SILENT_LOOPBACK:
            return CAN_LOOPBACK_FLAG | CAN_SILENT_FLAG;
        default:
            assert(0); // Mode should have been checked already
            return CAN_NORMAL_MODE;
    }
}
static void machine_can_port_init(machine_can_obj_t *self) {
    // Get peripheral object and do the first level config.
    struct machine_can_port *port = self->port;

    if (port == NULL) {
        port = m_new_obj(machine_can_port_t);
        self->port = port;
        mp_uint_t can_hw_id = can_index_table[self->can_idx];  // the hw can number 1..n
        port->can_inst = can_base_ptr_table[can_hw_id];
        port->can_hw_id = can_hw_id;
        port->flexcan_config = m_new_obj(flexcan_config_t);
        FLEXCAN_GetDefaultConfig(port->flexcan_config);
        mp_uint_t maxMbNum = FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(port->can_inst);
        port->flexcan_config->maxMbNum = maxMbNum;
        port->flexcan_config->disableSelfReception = true;

        port->flexcan_rx_fifo_config = m_new_obj(flexcan_rx_fifo_config_t);
        // Set the number of filters here. RFFN will be set accordingly.
        // This largest possible value is (CAN_CTRL2_RFFN_MASK >> CAN_CTRL2_RFFN_SHIFT) + 1) * 8.
        // If needed, lower these in steps of 8.
        mp_uint_t idFilterNum = CAN_IDFILTERNUM_MAX;
        port->flexcan_rx_fifo_config->idFilterNum = idFilterNum;
        port->flexcan_rx_fifo_config->idFilterType = kFLEXCAN_RxFifoFilterTypeA;
        port->flexcan_rx_fifo_config->priority = kFLEXCAN_RxFifoPrioHigh;
        port->flexcan_rx_fifo_config->idFilterTable = m_new0(uint32_t, idFilterNum);

        // Configure board-specific pin MUX based on the hardware device number.
        can_set_iomux(can_hw_id);

        // When selecting the CCM CAN clock source with CAN_CLK_SEL set to 2, the UART clock gate
        // will not open and CAN_CLK_ROOT will be off. To avoid this issue, set CAN_CLK_SEL to 0 or
        // 1 for CAN clock selection, or open the UART clock gate by configuring the CCM_CCGRx register.
        // There are two workarounds:
        // Set CAN_CLK_SEL to 0 or 1 for CAN clock selection, or if CAN_CLK_SEL is set to 2,
        // then the CCM must open any of UART clock gate by configuring the CCM_CCGRx register.
        #if (defined(FSL_FEATURE_CCM_HAS_ERRATA_50235) && FSL_FEATURE_CCM_HAS_ERRATA_50235)
        CLOCK_EnableClock(kCLOCK_Lpuart1);
        #endif // FSL_FEATURE_CCM_HAS_ERRATA_50235
    }

    // (Re-)configuration after init().
    port->flexcan_config->enableLoopBack = can_port_mode(self->mode) & CAN_LOOPBACK_FLAG;
    port->flexcan_config->enableListenOnlyMode = can_port_mode(self->mode) & CAN_SILENT_FLAG;
    port->flexcan_config->bitRate = self->bitrate;
    port->flexcan_config->enableIndividMask = true;

    uint32_t sourceClock_Hz = machine_can_port_f_clock(self);

    #if CAN_USE_UPSTREAM_TIMING
    // Load the configured timing parameters
    // brp will be calculated during FLEXCAN_Init
    port->flexcan_config->timingConfig.rJumpwidth = self->sjw - 1;
    port->flexcan_config->timingConfig.propSeg = 4; // Default start-up value
    // Fit tseg1 and propseg to the margins.
    if ((self->tseg1 - 2) < port->flexcan_config->timingConfig.propSeg) {
        // MIN(tseg1) = 2, so split the times with propSeg >= 0.
        port->flexcan_config->timingConfig.propSeg = (self->tseg1 - 2) / 2;
    }
    if ((self->tseg1 - port->flexcan_config->timingConfig.propSeg - 2) > CAN_PSEG1_MAX) {
        port->flexcan_config->timingConfig.propSeg = CAN_PROPSEG_MAX;
    }
    port->flexcan_config->timingConfig.phaseSeg1 = self->tseg1 - port->flexcan_config->timingConfig.propSeg - 2;
    port->flexcan_config->timingConfig.phaseSeg2 = self->tseg2 - 1;
    #else
    // Let the NXP lib calculate the timing and store them back for reporting.
    FLEXCAN_CalculateImprovedTimingValues(port->can_inst, self->bitrate, sourceClock_Hz, &port->flexcan_config->timingConfig);
    self->sjw = port->flexcan_config->timingConfig.rJumpwidth + 1;
    self->tseg1 = port->flexcan_config->timingConfig.phaseSeg1 + port->flexcan_config->timingConfig.propSeg + 2;
    self->tseg2 = port->flexcan_config->timingConfig.phaseSeg2 + 1;
    #endif

    // Initialise the CAN peripheral.
    FLEXCAN_Init(port->can_inst, port->flexcan_config, sourceClock_Hz);
    // Flexcan_Init may change brp, so report it back.
    self->brp = ((port->can_inst->CTRL1 & CAN_CTRL1_PRESDIV_MASK) >> CAN_CTRL1_PRESDIV_SHIFT) + 1;
    // Clear filters and filter masks
    machine_can_port_clear_filters(self);
    FLEXCAN_SetRxFifoConfig(port->can_inst, port->flexcan_rx_fifo_config, true);

    // FLEXCAN_SetRxFifoConfig() sets CTRL2->RFFN based on the above configured number of filters.
    // Calculate the Number of Mailboxes occupied by RX Legacy FIFO and the filter.
    mp_uint_t rffn = (uint8_t)((port->can_inst->CTRL2 & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
    port->flexcan_txmb_start = 6U + (rffn + 1U) * 2U;
    #if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
    (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
    // the first valid MB should be occupied by ERRATA 5461 or 5829.
    port->flexcan_txmb_start += 1U;
    #endif
    port->flexcan_txmb_count = port->flexcan_config->maxMbNum - port->flexcan_txmb_start;

    for (mp_uint_t i = 0; i < port->flexcan_txmb_count; i++) {
        FLEXCAN_SetTxMbConfig(port->can_inst, port->flexcan_txmb_start + i, true);
    }

    port->is_enabled = true;
    port->num_error_warning = 0;
    port->num_error_passive = 0;
    port->num_bus_off = 0;

    FLEXCAN_EnableMbInterrupts(port->can_inst,
        kFLEXCAN_RxFifoOverflowFlag | kFLEXCAN_RxFifoWarningFlag | kFLEXCAN_RxFifoFrameAvlFlag);

    FLEXCAN_EnableInterrupts(port->can_inst,
        kFLEXCAN_BusOffInterruptEnable | kFLEXCAN_ErrorInterruptEnable |
        kFLEXCAN_RxWarningInterruptEnable | kFLEXCAN_TxWarningInterruptEnable);

    mp_uint_t instance = FLEXCAN_GetInstance(port->can_inst);
    EnableIRQ(((IRQn_Type [])CAN_Rx_Warning_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Tx_Warning_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Error_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_Bus_Off_IRQS)[instance]);
    EnableIRQ(((IRQn_Type [])CAN_ORed_Message_buffer_IRQS)[instance]);
}

// The port must provide implementations of these low-level CAN functions
static int machine_can_port_f_clock(const machine_can_obj_t *self) {
    uint32_t sourceClock_Hz;
    #ifdef MIMXRT117x_SERIES
    sourceClock_Hz = can_clock_index_table[can_index_table[self->can_idx] - 1];
    #else
    sourceClock_Hz = BOARD_BOOTCLOCKRUN_CAN_CLK_ROOT;
    #endif
    return sourceClock_Hz;
}

static bool machine_can_port_supports_mode(const machine_can_obj_t *self, machine_can_mode_t mode) {
    return mode < MP_CAN_MODE_MAX;
}

